azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
/*
  # *Detector de movimiento, vibración, luz, temperatura y humedad relativa*

  *Detector inalámbrico de movimiento, vibración, luz, temperatura y humedad relativa* sobre plataforma ESP8266,
  que comunica los valores detectados a un servidor MQTT (like `mosquitto`). Útil para colocarlo en recintos alejados
  pero con acceso a wifi en integraciones de domótica.

  De funcionamiento muy sencillo, se conecta a la wifi local, y de ahí al servidor MQTT, donde publica los valores
  de temperatura, humedad y porcentaje de iluminación cada X segundos.
  (`MQTT_POSTINTERVAL_LIGHT_SEC` & `MQTT_POSTINTERVAL_DHT22_SEC`|`MQTT_POSTINTERVAL_BME280_SEC`).
  Los sensores binarios (movimiento, vibración e iluminación) se tratan mediante interrupciones (vs polling)
  y publican estados de 'on'/'off' en cuanto se produce un evento de activación.
  También escucha para recibir órdenes en JSON.

  Componentes:
  - ESP8266 mcu 1.0 dev kit / ESP32 Dev Kit
  - DHT22 / DHT11 sensor
  - PIR sensor
  - Vibration sensor
  - Light sensor (with AO + DO)
  - RGBLED + 3 resistors

  Edita, al menos, estos valores con tu configuración particular y flashea el programa con el Arduino IDE:
  ```
  //WiFi Settings
  #define WiFiSSID                            [REDACTED_WIFI_SSID]
  #define WiFiPSK                             [REDACTED_WIFI_PASSWORD]

  //MQTT Server Settings
  #define MQTT_SERVER                         [REDACTED_MQTT_SERVER_IP]
  #define MQTT_PORT                           [REDACTED_MQTT_SERVER_PORT]
  #define MQTT_USER                           [REDACTED_MQTT_USER]
  #define MQTT_PASSWORD                       [REDACTED_MQTT_PASSWD]
  ```

  Si quieres editar los MQTT `topic`'s de cada sensor, cambia también estos:
  ```
  #define mqtt_temp_topic                     "sensor/temp_"
  #define mqtt_humid_topic                    "sensor/hum_"
  #define mqtt_pressure_topic                 "sensor/pres_"
  #define mqtt_movement_topic                 "sensor/pir_"
  #define mqtt_vibro_topic                    "sensor/extra_"
  #define mqtt_light_topic                    "sensor/light_"
  #define mqtt_light_analog_topic             "sensor/light_analog_"

  #define mqtt_control_topic                  "control/module_"

  ```

  Al nombre del `topic` se le añade la MAC de la Wifi del ESP8266 (ej: `sensor/light_analog_abcdef012345`), de forma
  que los identificadores son únicos para cada chip, por lo que, si utilizas varios de estos detectores, no hay
  necesidad de cambiar el programa para cada uno.

  ### Changelog ESP8266 MQTT Publisher

  - v1.0: PIR+Vibration+Light(AO+DO)+DHT22 sensors publishing values to a local mosquitto server.
  - v1.1: Fixed some errors, Better error handling with DHT22, different publish frecuency for light & DHT22,
        negate digital_light sensor, and some refactoring.
  - v1.2: Added ESP32 support with a compilation flag, Compiles OK but it's NOT WORKING:
  ```
  Guru Meditation Error of type LoadProhibited occurred on core  1. Exception was unhandled.
  Register dump:
  PC      : 0x400d1de8  PS      : 0x00060c30  A0      : 0x800d214a  A1      : 0x3ffc7440
  A2      : 0x3ffc1f98  A3      : 0x000000c8  A4      : 0x3f40156f  A5      : 0x3ffc7560
  A6      : 0x3ffc7540  A7      : 0x00000008  A8      : 0x800d83c5  A9      : 0x3ffc7390
  A10     : 0x00000000  A11     : 0x3ffc7486  A12     : 0x00000000  A13     : 0x3f40156f
  A14     : 0x00000000  A15     : 0x00000000  SAR     : 0x0000001f  EXCCAUSE: 0x0000001c
  EXCVADDR: 0x00000000  LBEG    : 0x400014fd  LEND    : 0x4000150d  LCOUNT  : 0xfffffffc

  Backtrace: 0x400d1de8:0x3ffc7440 0x400d214a:0x3ffc7460 0x400d21dd:0x3ffc7580 0x400d1745:0x3ffc75a0 0x400d11a2:0x3ffc75c0 0x400d1227:0x3ffc75e0 0x400de7d2:0x3ffc7610

  CPU halted.
  ```
  - v1.3: MQTT subscribe at `control/module_MAC`/ `control/out_module_MAC`, JSON payload,
        set RGB color with `{"color": [100, 0, 255]}`; Auto reboot if no wifi or many dht errors;
        mqtt error descriptions; some fixes. PINOUT with esp8266_breadboard & dht11.
  - v1.4: BME280 temperature + humidity + pressure sensor (much better than the DHT variants!);
        switch ON/OFF Leds & binary sensors with mqtt (MQTT switches for HA)

  ### Librerías:

  - ESP8266WiFi v1.0 || WiFiEsp v2.1.2
  - PubSubClient v2.6
  - ArduinoJson v5.8.4
  - elapsedMillis v1.0.3
  - Adafruit_Unified_Sensor v1.0.2
  - DHT_sensor_library v1.3.0
  - Adafruit_BME280_Library v1.0.5
*/
//**********************************
//** USER SETTINGS *****************
//**********************************
// MQTT settings
#define MQTT_SERVER                         [REDACTED_MQTT_SERVER_IP]
#define MQTT_PORT                           [REDACTED_MQTT_SERVER_PORT]
#define MQTT_USER                           [REDACTED_MQTT_USER]
#define MQTT_PASSWORD                       [REDACTED_MQTT_PASSWD]
#define MQTT_USERID                         "ESP8266Client"

// MQTT topics
#define mqtt_temp_topic                     "sensor/temp_"
#define mqtt_temp_ds_topic                  "sensor/temp_ds_"
#define mqtt_humid_topic                    "sensor/hum_"
#define mqtt_pressure_topic                 "sensor/pres_"
#define mqtt_movement_topic                 "sensor/pir_"
#define mqtt_vibro_topic                    "sensor/extra_"
#define mqtt_light_topic                    "sensor/light_"
#define mqtt_light_analog_topic             "sensor/light_analog_"

#define MQTT_WILLTOPIC                      "control/online_"
#define MQTT_WILLQOS                        2
#define MQTT_WILLRETAIN                     HIGH
#define MQTT_STATE_OFF                      "off"
#define MQTT_STATE_ON                       "on"

#define mqtt_control_topic                  "control/module_"
#define mqtt_switch_bin_sensors_subtopic    "/switch_bin"
#define mqtt_switch_leds_subtopic           "/switch_leds"
#define mqtt_subtopic_set                   "/set"

// WiFi Settings
#define WiFiSSID                            [REDACTED_WIFI_SSID]
#define WiFiPSK                             [REDACTED_WIFI_PASSWORD]

//**********************************
//** PINOUT ************************
//** comment to deactivate        **
//**********************************
// Master switches:
#define ESP_TEST1
//#define ESP_COCINA
//#define USE_ESP32
//#define ESP_GALERIA

//**********************************

#ifdef USE_ESP32
#define DHTTYPE                             DHT11  // DHT22 (AM2302) / DHT11
#define DHTPIN                              17     //IO17
#define LED_RGB_RED                         2      //IO02
#define LED_RGB_GREEN                       4      //IO04
#define LED_RGB_BLUE                        16     //IO16

