azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
#define PIN_PIR                             21     //IO21
#define PIN_VIBRO                           22     //IO22
#define PIN_LIGHT_SENSOR_DIGITAL            34     //IO34
#define PIN_LIGHT_SENSOR_ANALOG             35
#endif

#ifdef ESP_TEST1
#define LED_PIR                             16     //D0
#define LED_VIBRO                           3      //RX - in dht11 breadboard
#define LED_RGB_RED                         12     //D6
#define LED_RGB_GREEN                       13     //D7
#define LED_RGB_BLUE                        15     //D8
#define PIN_PIR                             2      //D4
#define PIN_VIBRO                           0      //D3 - dht11 breadboard
#define PIN_LIGHT_SENSOR_DIGITAL            14     //D5
#define PIN_LIGHT_SENSOR_ANALOG             A0     //A0

#define PIN_I2C_BME280_SDA                  4     //D2
#define PIN_I2C_BME280_SCL                  5     //D1
#endif

#ifdef ESP_GALERIA
#define ONE_WIRE_BUS                        2      //D4

//#define DHTTYPE                             DHT22
//#define DHTPIN                              4      //D2

//#define LED_PIR                             16     //D0
//#define LED_VIBRO                           3      //RX - in dht11 breadboard
#define LED_RGB_RED                         12     //D6
#define LED_RGB_GREEN                       13     //D7
#define LED_RGB_BLUE                        15     //D8

#define PIN_PIR                             0      //D3
//#define PIN_VIBRO                           0      //D3 - dht11 breadboard
//#define PIN_LIGHT_SENSOR_DIGITAL            14     //D5
//#define PIN_LIGHT_SENSOR_ANALOG             A0     //A0

//#define PIN_I2C_BME280_SDA                  4     //D2
//#define PIN_I2C_BME280_SCL                  5     //D1
#endif

#ifdef ESP_COCINA
#define DHTTYPE                             DHT22  // DHT22 (AM2302) / DHT11
#define DHTPIN                              2      //D4 (DHT sensor)
#define LED_RGB_RED                         12     //D6
#define LED_RGB_GREEN                       13     //D7
#define LED_RGB_BLUE                        15     //D8
#define PIN_PIR                             0      //D3
#define PIN_LIGHT_SENSOR_ANALOG             A0     //A0
#define NEGATE_SENSOR_ANALOG
#endif

//**********************************
//** Configuración *****************
//**********************************
#define VERBOSE                             true

#define DELTA_TEMP_BME280                   -.3  // Temperature offset for BME280 (self-heating!)

#define MQTT_POSTINTERVAL_DHT22_SEC         20
#define MQTT_POSTINTERVAL_BME280_SEC        40
#define MQTT_POSTINTERVAL_DS18B20_SEC       20
#define MQTT_POSTINTERVAL_LIGHT_SEC         45

#define DELAY_MIN_MS_ENTRE_MOVS             5000
#define DELAY_MIN_MS_ENTRE_VIBRO_SENSOR     4000
#define DELAY_MIN_MS_ENTRE_LIGHT_SENSOR     3000

#define DELTA_MS_TO_TURN_OFF_MOVS           3000
#define DELTA_MS_TO_TURN_OFF_VIBRO          3000
#define PERSISTENT_STATE_MS_UNTIL_STANDBY   2000

//Settings for recording samples
#define RESULTS_SAMPLE_RATE                 8            // # seconds between samples
#define SENSOR_HISTORY_RECORDS              10           // # records to keep
#define NUM_MAX_ERRORS_DHT                  20           // Abort on max

//**********************************
//** Librerías *********************
//**********************************
#ifdef USE_ESP32
#include "WiFiEsp.h"
#else
#include <ESP8266WiFi.h>
#endif
#include <PubSubClient.h>
//#include <ArduinoJson.h>
#include <elapsedMillis.h>
#include <list>
#ifdef DHTPIN
#include <Adafruit_Sensor.h>  // - Adafruit Unified Sensor Library: https://github.com/adafruit/Adafruit_Sensor
#include <DHT.h>              // - DHT Sensor Library: https://github.com/adafruit/DHT-sensor-library
#include <DHT_U.h>
#endif
#ifdef PIN_I2C_BME280_SDA
#include <Wire.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_BME280.h>
#endif

#ifdef ONE_WIRE_BUS
#include <OneWire.h>
#include <DallasTemperature.h>
#endif

//**********************************
//** Variables *********************
//**********************************
#define DELAY_MS_BETWEEN_RETRIES            250
#define DELAY_MS_BETWEEN_MQTT_PUB_STATE     35000

char MAC_char[18];                          //MAC address in ascii
//Wifi client
#ifdef USE_ESP32
WiFiEspClient wifiClient;
#else
WiFiClient wifiClient;
#endif
//MQTT client
void callback_mqtt_message_received(char* topic, byte* payload, unsigned int length);
PubSubClient client(MQTT_SERVER, MQTT_PORT, callback_mqtt_message_received, wifiClient);

// Control switches:
bool use_leds = HIGH;
bool in_default_state_use_leds = HIGH;
bool use_binary_sensors = HIGH;
bool in_default_state_binary_sensors = HIGH;

#ifdef DHTPIN                               // DHT22/DHT11 sensor settings.
DHT_Unified dht(DHTPIN, DHTTYPE);
// Variables for recording samples of the DHT22 sensor.
std::list<double> tempSamples;   //Collected results per interval
std::list<double> humidSamples;  //Collected results per interval
std::list<double> tempHistory;   //History over time.
std::list<double> humidHistory;  //History over time.
#endif

#ifdef PIN_I2C_BME280_SDA                   // BME280 sensor (I2C)
Adafruit_BME280 bme;                        // I2C
// Variables for recording samples of the DHT22 sensor.
std::list<double> bme_tempSamples;   //Collected results per interval
std::list<double> bme_humidSamples;  //Collected results per interval
std::list<double> bme_pressureSamples;  //Collected results per interval
std::list<double> bme_tempHistory;   //History over time.
std::list<double> bme_humidHistory;  //History over time.
std::list<double> bme_pressureHistory;  //History over time.
#endif

// ###################################################
// DALLAS DS18b20 SENSORS                  ###########
// ###################################################
#ifdef ONE_WIRE_BUS                         // DS18b20 temperature sensors
OneWire oneWire(ONE_WIRE_BUS);
DallasTemperature DS18B20(&oneWire);

#ifdef ESP_GALERIA
#define NUM_SENSORS_DS18B20 3
uint8_t ds18b20Probes[8 * NUM_SENSORS_DS18B20] = {
  0x28, 0x5E, 0x59, 0x01, 0x00, 0x00, 0x80, 0x46,
  0x28, 0x88, 0x45, 0x01, 0x00, 0x00, 0x80, 0x6D,
  0x28, 0x16, 0x42, 0x01, 0x00, 0x00, 0x80, 0x9E,
};
std::list<double> ds18b20_tempSamples_arr[NUM_SENSORS_DS18B20];   //Collected results per interval
std::list<double> ds18b20_tempHistory_arr[NUM_SENSORS_DS18B20];   //History over time
#endif
#endif

// Contadores de tiempo
elapsedMillis sinceStart;
int last_sensor_error;
int last_sensor_ok;
int last_dht_sensed;         //The last time a sample was taken from the DHT22 sensor.
int last_bme_sensed;         //The last time a sample was taken from the BME280 sensor.
int last_ds18b20_sensed;     //The last time a sample was taken from the DS18b20 sensors.
int error_counter_dht;

