azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
// Last OK message for each sensor/topic:
int last_temp_post;
int last_temp_ds_post;
int last_humid_post;
int last_pressure_post;
int last_light_analog_post;

int last_switch_bin_state_post;
int last_switch_leds_state_post;

// Estados (para el output LED RGB)
#define STATE_ERROR            1
#define STATE_WARN             2
#define STATE_BIN_PUBLISH      3
#define STATE_OK_MEASURE       4
#define STATE_OK_PUBLISH       5
#define STATE_INIT             6
#define STATE_STANDBY          7
#define STATE_CRITICAL         8
int current_state;
int last_state_change;

// Binary sensors variables for control them within interrupts
volatile int last_pir_trigered = 0;
volatile int last_vibro_trigered = 0;
volatile int last_light_trigered = 0;

volatile bool pir_state = LOW;
volatile bool vibro_state = LOW;
volatile bool light_state = LOW;
bool last_light_post_state = LOW;

volatile bool flag_publish_pir = LOW;
volatile bool flag_publish_vibro = LOW;
volatile bool flag_publish_light = LOW;

//**********************************
//** SETUP
//**********************************
void setup()
{
  uint8_t MAC_array[6];

  Serial.begin(9600);
  setup_timers();
  setup_leds();
  set_state(STATE_INIT);
  connectWiFi();

  //Get the mac and convert it to a string.
  WiFi.macAddress(MAC_array);
  for (int i = 0; i < sizeof(MAC_array); ++i)
  {
    sprintf(MAC_char, "%s%02x", MAC_char, MAC_array[i]);
  }

#ifdef DHTPIN
  setup_dht_sensor();
#endif
#ifdef PIN_I2C_BME280_SDA
  setup_bme280_sensor();
#endif
#ifdef ONE_WIRE_BUS
  setup_dallas_sensors();
#endif
  setup_boolean_sensors();

  if (VERBOSE) {
    Serial.print("MAC ADRESS: ");
    Serial.println(MAC_char);
  }
  set_state(STATE_CRITICAL);
}

//**********************************
//** LOOP
//**********************************
void loop()
{
  bool sensor_ok = false;
  bool sensed_data = false;
  bool bin_publish = false;
  int mqtt_retries = 0;

  //Reconnect if disconnected.
  if (WiFi.status() != WL_CONNECTED)
  {
    set_state(STATE_CRITICAL);
    connectWiFi();
  }

  //Check the MQTT connection and process it
  if (!client.connected())
  {
    while (!client.connected())
    {
      if (!client.connect((MQTT_USERID + String(MAC_char)).c_str(), MQTT_USER, MQTT_PASSWORD,
                          (MQTT_WILLTOPIC + String(MAC_char)).c_str(), MQTT_WILLQOS,
                          MQTT_WILLRETAIN, MQTT_STATE_OFF))
      {
        set_state(STATE_ERROR);
        if (VERBOSE)
        {
          Serial.print(i_text_state_pubsubclient(client.state()));
          Serial.print("MQTT retry # ");
          Serial.println(mqtt_retries);
        }
        delay(DELAY_MS_BETWEEN_RETRIES);
      }
      mqtt_retries += 1;
    }
    client.subscribe((mqtt_control_topic + String(MAC_char) + mqtt_switch_bin_sensors_subtopic + mqtt_subtopic_set).c_str());
    client.subscribe((mqtt_control_topic + String(MAC_char) + mqtt_switch_leds_subtopic + mqtt_subtopic_set).c_str());
    client.subscribe((MQTT_WILLTOPIC + String(MAC_char)).c_str());
    publish_switch_states();
  }
  client.loop();

  turn_off_motion_sensors_after_delay();
  bin_publish = publish_binary_sensors_if_flag_or_delta();
#ifdef DHTPIN
  sample_dht22_sensor_data(&sensed_data, &sensor_ok);
#endif
#ifdef ONE_WIRE_BUS
  sample_ds18b20_sensor_data(&sensed_data, &sensor_ok);
#endif
#ifdef PIN_I2C_BME280_SDA
  sample_bme280_sensor_data(&sensed_data, &sensor_ok);
#endif

  if (publish_analog_light_at_delta() || publish_dht22_sensor_data() || publish_bme280_sensor_data() || publish_ds18b20_sensor_data())
  {
    set_state(STATE_OK_PUBLISH);
  }
  else if (sensed_data && sensor_ok)
  {
    set_state(STATE_OK_MEASURE);
  }
  else if (sensed_data)
  {
    set_state(STATE_WARN);
  }
  else if (bin_publish)
  {
    set_state(STATE_BIN_PUBLISH);
  }
  else
  {
    auto_standby();
  }
}

//**********************************
//** METHODS
//**********************************
const char *i_text_state_pubsubclient(int state)
{
  //Returns the current state of the client. If a connection attempt fails, this can be used to get more information about the failure.
  switch (state)
  {
    case -4:
      return "MQTT_CONNECTION_TIMEOUT - the server did not respond within the keepalive time";
    case -3:
      return "MQTT_CONNECTION_LOST - the network connection was broken";
    case -2:
      return "MQTT_CONNECT_FAILED - the network connection failed";
    case -1:
      return "MQTT_DISCONNECTED - the client is disconnected cleanly";
    case 0:
      return "MQTT_CONNECTED - the cient is connected";
    case 1:
      return "MQTT_CONNECT_BAD_PROTOCOL - the server does not support the requested version of MQTT";
    case 2:
      return "MQTT_CONNECT_BAD_CLIENT_ID - the server rejected the client identifier";
    case 3:
      return "MQTT_CONNECT_UNAVAILABLE - the server was unable to accept the connection";
    case 4:
      return "MQTT_CONNECT_BAD_CREDENTIALS - the username/password were rejected";
    case 5:
      return "MQTT_CONNECT_UNAUTHORIZED - the client was not authorized to connect";
  }
  return "MQTT_STATE ????";
}

void auto_standby()
{
  if ((sinceStart - last_state_change > PERSISTENT_STATE_MS_UNTIL_STANDBY)
      && current_state != STATE_STANDBY && !i_state_critical())
  {
    set_state(STATE_STANDBY);
  }
}

void turn_off_motion_sensors_after_delay()
{
#ifdef PIN_PIR
  // PIR binary sensor to off after a delay:
  if (pir_state && (sinceStart - last_pir_trigered > DELTA_MS_TO_TURN_OFF_MOVS))
  {
    pir_state = LOW;
    flag_publish_pir = HIGH;
  }
#endif

#ifdef PIN_VIBRO
  // Vibration binary sensor to off after a delay:
  if (vibro_state && (sinceStart - last_vibro_trigered > DELTA_MS_TO_TURN_OFF_VIBRO))
  {
    vibro_state = LOW;
    flag_publish_vibro = HIGH;
  }
#endif
}

void set_color_rgb(uint16_t red, uint16_t green, uint16_t blue)
{
#ifdef LED_RGB_RED
#ifdef USE_ESP32
  // hueToRGB(color, brightness);  // call function to convert hue to RGB
  // write the RGB values to the pins
  ledcWrite(1, (uint32_t)(red / 4)); // write red component to channel 1, etc.
  ledcWrite(2, (uint32_t)(green / 4));
  ledcWrite(3, (uint32_t)(blue / 4));
#else
  analogWrite(LED_RGB_RED, red);
  analogWrite(LED_RGB_GREEN, green);
  analogWrite(LED_RGB_BLUE, blue);
#endif
#endif
}

bool i_state_critical()
{
  switch (current_state)
  {
    case STATE_INIT:
    case STATE_OK_MEASURE:
    case STATE_OK_PUBLISH:
    case STATE_BIN_PUBLISH:
    case STATE_STANDBY:
      {
        return false;
      }
    //    case STATE_WEBACCESS:
    case STATE_ERROR:
    case STATE_WARN:
    case STATE_CRITICAL:
      {
        return true;
      }
  }
}

void set_state(int new_state)
{
  bool state_changed = current_state != new_state;
  current_state = new_state;
  last_state_change = sinceStart;

  // Set RGB LED state:
  if (use_leds)
  {
    switch (current_state)
    {
      case STATE_INIT:
        {
          set_color_rgb(1023, 1023, 1023);
          break;
        }
      case STATE_ERROR:
        {
          if (VERBOSE && state_changed)
            Serial.println("ERROR STATE (red)");
          set_color_rgb(1023, 0, 0);
          break;
        }
      case STATE_WARN:
        {
          if (VERBOSE && state_changed)
            Serial.println("WARNING STATE (R+.5G)");
          set_color_rgb(1023, 512, 0);
          break;
        }
      case STATE_CRITICAL:
        {
          if (VERBOSE && state_changed)
            Serial.println("CRITICAL STATE (violet)");
          set_color_rgb(1023, 0, 1023);
          break;
        }
      case STATE_OK_MEASURE:
        {
          set_color_rgb(0, 0, 1023);
          break;
        }
      case STATE_OK_PUBLISH:
        {
          //      Serial.println("OK PUBLISH");
          set_color_rgb(0, 1023, 0);
          break;
        }
      case STATE_BIN_PUBLISH:
        {
          //      Serial.println("OK PUBLISH");
          set_color_rgb(0, 255, 512);
          break;
        }
      case STATE_STANDBY:
        {
          set_color_rgb(0, 0, 0);
          break;
        }
    }
  }
  else
  {
    set_color_rgb(0, 0, 0);
  }
}

