azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
void isr_pir_change()
{
  if (use_binary_sensors && !pir_state && (sinceStart - last_pir_trigered > DELAY_MIN_MS_ENTRE_MOVS))
  {
    pir_state = HIGH;
    flag_publish_pir = HIGH;
  }
  last_pir_trigered = sinceStart;
}

void isr_vibro_change()
{
  if (use_binary_sensors && !vibro_state && (sinceStart - last_vibro_trigered > DELAY_MIN_MS_ENTRE_VIBRO_SENSOR))
  {
    vibro_state = HIGH;
    flag_publish_vibro = HIGH;
  }
  last_vibro_trigered = sinceStart;
}

#ifdef PIN_LIGHT_SENSOR_DIGITAL
void isr_light_sensor_change()
{
  if (use_binary_sensors && sinceStart - last_light_trigered > DELAY_MIN_MS_ENTRE_LIGHT_SENSOR)
  {
    bool new_light_state = digitalRead(PIN_LIGHT_SENSOR_DIGITAL);
    if (new_light_state != light_state)
    {
      light_state = !light_state;
      flag_publish_light = HIGH;
    }
  }
  last_light_trigered = sinceStart;
}
#endif

#ifdef PIN_LIGHT_SENSOR_ANALOG
float read_analog_light_percentage()
{
#ifdef NEGATE_SENSOR_ANALOG
  return round(100. * analogRead(PIN_LIGHT_SENSOR_ANALOG) /  10.23) / 100.;
#else
  return round(100. * (1023 - analogRead(PIN_LIGHT_SENSOR_ANALOG)) /  10.23) / 100.;
#endif
}
#endif

void sample_dht22_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef DHTPIN
  // Collect the DHT22 sensor data
  if (sinceStart - last_dht_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp = -999;
    double humid = -999;
    sensors_event_t event;

    *sampled = true;
    //Collect the temperature from a sensor.
    dht.temperature().getEvent(&event);
    if (!isnan(event.temperature))
    {
      temp = event.temperature;
      if (VERBOSE) {
        Serial.print("Temp: ");
        Serial.print(temp);
        Serial.print(" ^C, ");
      }
    }
    // Get humidity event and print its value.
    dht.humidity().getEvent(&event);
    if (!isnan(event.relative_humidity))
    {
      humid = event.relative_humidity;
      if (VERBOSE) {
        Serial.print("Humidity: ");
        Serial.print(humid);
        Serial.println(" %");
      }
    }

    if ((temp == -999) || (humid == -999))
    {
      sensor_t sensor;
      if (VERBOSE) {
        Serial.print("DHT ERROR # ");
        Serial.print(error_counter_dht);
        Serial.print(": ");
        Serial.print(temp);
        Serial.print(" / ");
        Serial.println(humid);
      }
      dht.begin();
      dht.temperature().getSensor(&sensor);
      last_sensor_error = sinceStart;
      error_counter_dht += 1;
      *sample_ok = false;

      if (error_counter_dht > NUM_MAX_ERRORS_DHT)
        reset_exec();
    }
    else
    {
      last_sensor_ok = sinceStart;
      *sample_ok = true;
      error_counter_dht = 0;

      //Make sure a valid temperature was sampled
      if (temp != -999)
        tempSamples.push_front(temp);

      if (humid != -999)
        humidSamples.push_front(humid);
    }

    last_dht_sensed = sinceStart;
  }
#endif
}

void sample_bme280_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef PIN_I2C_BME280_SDA
  // Collect the sensor data
  if (sinceStart - last_bme_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp, humid, pressure;

    *sampled = true;
    *sample_ok = true;

    bme.takeForcedMeasurement();

    temp = bme.readTemperature();
    humid = bme.readHumidity();
    pressure = bme.readPressure() / 100.0F;

    if (VERBOSE) {
      Serial.print("Temp: ");
      Serial.print(temp);
      Serial.print(" ^C, ");
      Serial.print("Humidity: ");
      Serial.print(humid);
      Serial.print(" %, ");
      Serial.print("Pressure: ");
      Serial.print(pressure);
      Serial.println(" mbar");
    }
    if (temp)
    {
      temp += DELTA_TEMP_BME280;
      bme_tempSamples.push_front(temp);
    }
    if (humid)
      bme_humidSamples.push_front(humid);
    if (pressure)
      bme_pressureSamples.push_front(pressure);
    if (!temp | !humid | !pressure)
      *sample_ok = false;
    last_bme_sensed = sinceStart;
  }
#endif
}

#ifdef ONE_WIRE_BUS
bool i_push_front_ds18b20_temp(uint8_t index, DeviceAddress address,
                               std::list<double> *temp_samples)
{
  float temp;

  temp = DS18B20.getTempC(address);
  //temp = DS18B20.getTempCByIndex(index);
  if (temp > -20 & temp < 75)
  {
    temp_samples->push_front(temp);
    if (VERBOSE) {
      Serial.print("DS18b20-");
      Serial.print(index + 1);
      Serial.print(" - Temperature: ");
      Serial.print(temp);
      Serial.println(" ^C");
    }
    return true;
  }
  return false;
}
#endif

void sample_ds18b20_sensor_data(bool *sampled, bool *sample_ok)
{
  *sampled = false;
  *sample_ok = false;

#ifdef ONE_WIRE_BUS
  // Collect the sensor data
  if (sinceStart - last_ds18b20_sensed > RESULTS_SAMPLE_RATE * 1000)
  {
    double temp = -127.;

    while (temp == 85.0 || temp == -127.0) {
      DS18B20.requestTemperatures();
      temp = DS18B20.getTempCByIndex(0);

//      TODO comparador con última muestra (para eliminar 'outlets')
      if (VERBOSE && (temp > 60.0 || temp < -15.0)) {
        Serial.print("Bad temperature reading: ");
        Serial.print(temp);
        Serial.println(" ^C");
      }
    }
    *sampled = true;

    if (temp)
    {
      *sample_ok = true;
      for (uint8_t i = 0; i < NUM_SENSORS_DS18B20; i++)
      {
        uint8_t address[8];
        for (uint8_t j=0; j<8; j++)
          address[j] = ds18b20Probes[i*8+j];
        if (!i_push_front_ds18b20_temp(i, address, &ds18b20_tempSamples_arr[i]))
          if (VERBOSE) {
            Serial.print("BAD READING DS18b20-");
            Serial.println(i + 1);
          }
      }
      last_ds18b20_sensed = sinceStart;
    }
  }
#endif
}

void calc_sensor_stats(std::list<double> *samples, std::list<double> *history)
{
  int count = 0;
  double samples_sum = 0;
  double samples_average;

  if (samples->size() > 0)
  {
    for (std::list<double>::iterator sensiter = samples->begin(); sensiter != samples->end(); sensiter++)
    {
      count++;
      samples_sum += *sensiter;
    }
    samples_average = samples_sum / count;

    //Add the new data to the history.
    history->push_front(samples_average);
    if (history->size() > SENSOR_HISTORY_RECORDS)
    {
      history->pop_back();
    }
  }
  samples->clear();
}

//**********************************
//** Setup methods
//**********************************
void setup_timers()
{
  sinceStart = 0;
  last_state_change = 0;
  last_sensor_error = 0;
  last_sensor_ok = 0;
  last_dht_sensed = 0;                //The last time a sample was taken from the DHT22 sensor.
  last_ds18b20_sensed = 0;
  last_bme_sensed = 0;
  error_counter_dht = 1;

  // Init values to wait some time before the 1st publish.
  last_temp_post = 15000;
  last_temp_ds_post = 10000;
  last_humid_post = 15000;
  last_pressure_post = 15000;
  last_light_analog_post = 10000;
  last_switch_bin_state_post = 0;
  last_switch_leds_state_post = 0;
}

void setup_leds()
{
#ifdef LED_PIR
  pinMode(LED_PIR, OUTPUT);
#endif
#ifdef LED_VIBRO
  pinMode(LED_VIBRO, OUTPUT);
#endif

#ifdef LED_RGB_RED
#ifdef USE_ESP32
  ledcAttachPin(LED_RGB_RED, 1); // assign RGB led pins to channels
  ledcAttachPin(LED_RGB_GREEN, 2);
  ledcAttachPin(LED_RGB_BLUE, 3);
  // Initialize channels
  // channels 0-15, resolution 1-16 bits, freq limits depend on resolution
  // ledcSetup(uint8_t channel, uint32_t freq, uint8_t resolution_bits);
  ledcSetup(1, 12000, 8); // 12 kHz PWM, 8-bit resolution
  ledcSetup(2, 12000, 8);
  ledcSetup(3, 12000, 8);
#else
  pinMode(LED_RGB_RED, OUTPUT);
  pinMode(LED_RGB_GREEN, OUTPUT);
  pinMode(LED_RGB_BLUE, OUTPUT);
#endif
#endif
}

#ifdef DHTPIN
void setup_dht_sensor()
{
  dht.begin();
  sensor_t sensor;
  dht.temperature().getSensor(&sensor);
  if (VERBOSE) {
    Serial.println("------------------------------------");
    Serial.println("Temperature");
    Serial.print  ("Sensor:       "); Serial.println(sensor.name);
    Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
    Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
    Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println(" *C");
    Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println(" *C");
    Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println(" *C");
    Serial.println("------------------------------------");
  }
  dht.humidity().getSensor(&sensor);
  // Print humidity sensor details.
  dht.humidity().getSensor(&sensor);
  if (VERBOSE) {
    Serial.println("------------------------------------");
    Serial.println("Humidity");
    Serial.print  ("Sensor:       "); Serial.println(sensor.name);
    Serial.print  ("Driver Ver:   "); Serial.println(sensor.version);
    Serial.print  ("Unique ID:    "); Serial.println(sensor.sensor_id);
    Serial.print  ("Max Value:    "); Serial.print(sensor.max_value); Serial.println("%");
    Serial.print  ("Min Value:    "); Serial.print(sensor.min_value); Serial.println("%");
    Serial.print  ("Resolution:   "); Serial.print(sensor.resolution); Serial.println("%");
    Serial.println("------------------------------------");
  }
}
#endif

#ifdef PIN_I2C_BME280_SDA
void setup_bme280_sensor()
{
  bool bme_status;

  // default settings
  bme_status = bme.begin();
  if (!bme_status)
  {
    if (VERBOSE)
      Serial.println("Could not find a valid BME280 sensor, check wiring!");
    set_state(STATE_CRITICAL);
    delay(10000);
    reset_exec();
  }
  /* bme.setSampling(sensor_mode mode  = MODE_NORMAL,
         sensor_sampling tempSampling  = SAMPLING_X16,
         sensor_sampling pressSampling = SAMPLING_X16,
         sensor_sampling humSampling   = SAMPLING_X16,
         sensor_filter filter          = FILTER_OFF,
         standby_duration duration     = STANDBY_MS_0_5
  ); */
  //bme.setSampling(Adafruit_BME280::MODE_NORMAL, Adafruit_BME280::SAMPLING_X2, Adafruit_BME280::SAMPLING_X2, Adafruit_BME280::SAMPLING_X2, Adafruit_BME280::FILTER_OFF, Adafruit_BME280::STANDBY_MS_1000);
  bme.setSampling(Adafruit_BME280::MODE_FORCED, Adafruit_BME280::SAMPLING_X1, Adafruit_BME280::SAMPLING_X1, Adafruit_BME280::SAMPLING_X1, Adafruit_BME280::FILTER_OFF, Adafruit_BME280::STANDBY_MS_1000);

  delay(100); // let sensor boot up
}
#endif

#ifdef ONE_WIRE_BUS
void discoverOneWireDevices(void)
{
  byte i;
  byte present = 0;
  byte data[12];
  byte addr[8];

  Serial.print("Looking for 1-Wire devices...\n\r");// "\n\r" is NewLine
  while(oneWire.search(addr)) {
    Serial.print("\n\r\n\rFound \'1-Wire\' device with address:\n\r");
    for( i = 0; i < 8; i++) {
      Serial.print("0x");
      if (addr[i] < 16) {
        Serial.print('0');
      }
      Serial.print(addr[i], HEX);
      if (i < 7) {
        Serial.print(", ");
      }
    }
    if ( OneWire::crc8( addr, 7) != addr[7]) {
      Serial.print("CRC is not valid!\n\r");
      return;
    }
  }
  Serial.println();
  Serial.print("Done");
  oneWire.reset_search();
  return;

//  TODO control de sondas conectadas vs sondas definidas
}

