azogue/hass_config/esp8266_sensors/mqtt_pir_vibro_light_dht22_publisher.c
    if (publishing)
      last_temp_ds_post = sinceStart;
  }
#endif

  return publishing;
}

bool publish_mqtt_data(const char* type_publish, const char* topic_prefix, const char* payload, boolean retained)
{
  bool published;

  published = client.publish((topic_prefix + String(MAC_char)).c_str(), payload, retained);
  if (VERBOSE && published)
  {
    Serial.print("PUBLISH ");
    Serial.print(type_publish);
    Serial.print(": topic=");
    Serial.print((topic_prefix + String(MAC_char)).c_str());
    Serial.print(" -> ");
    Serial.println(payload);
  }
  return published;
}

bool publish_mqtt_binary_sensor(const char* name_on, const char* name_off,
                                bool state, const char* topic)
{
  if (state)
    return publish_mqtt_data(name_on, topic, MQTT_STATE_ON, true);
  else
    return publish_mqtt_data(name_off, topic, MQTT_STATE_OFF, true);
}

void publish_online_state()
{
  bool publish_ok = false;
  do {
    publish_ok = client.publish((MQTT_WILLTOPIC + String(MAC_char)).c_str(), MQTT_STATE_ON, MQTT_WILLRETAIN);
  } while (!publish_ok);

  if (VERBOSE)
    Serial.println("PUBLISHING STATE ON");
}

//bool read_json(byte *payload, unsigned int payload_length)
//{
//  StaticJsonBuffer<500> jsonBuffer;
//  char *json = (char*)payload;
//  JsonObject& root = jsonBuffer.parseObject(json);
//
//  // Test if parsing succeeds.
//  if (!root.success())
//  {
//    Serial.println("parseObject() failed");
//    return false;
//  }
//  else if (root.containsKey("color"))
//  {
//    // Fetch values.
//    uint16_t R, G, B;
//    R = root["color"][0];
//    G = root["color"][1];
//    B = root["color"][2];
//    Serial.print("RGB RECEIVED: (");
//    Serial.print(R);
//    Serial.print(", ");
//    Serial.print(G);
//    Serial.print(", ");
//    Serial.print(B);
//    Serial.println(")");
//    set_color_rgb(4 * R, 4 * G, 4 * B);
//    return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "COLOR SET");
//  }
//  else if (root.containsKey("led"))
//  {
//    bool new_use_leds = root["led"];
//    Serial.print("RECEIVED LED USE=");
//    Serial.print(new_use_leds);
//    if (new_use_leds != use_leds)
//    {
//      use_leds = new_use_leds;
//      set_state(STATE_STANDBY);
//      return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "USE LED CHANGE OK");
//    }
//    return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "USE LED NO CHANGE");
//  }
//  else if (root.containsKey("binary_sensors"))
//  {
//    bool new_use_bin_sensors = root["binary_sensors"];
//    Serial.print("RECEIVED BINARY_SENSORS USE=");
//    Serial.print(new_use_bin_sensors);
//    if (new_use_bin_sensors != use_binary_sensors)
//    {
//      use_binary_sensors = new_use_bin_sensors;
//      return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "USE BINARY_SENSORS CHANGE OK");
//    }
//    return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), "USE BINARY_SENSORS NO CHANGE");
//  }
//
//  return client.publish((mqtt_control_topic_out + String(MAC_char)).c_str(), payload, payload_length);
//}

bool i_contains(const char *str1, const char *str2)
{
  char *contains;
  contains = strstr(str1, str2);
  if (contains)
    return true;
  return false;
}

void i_print_mqtt_msg(const char *topic, const char *message)
{
  if (VERBOSE)
  {
    Serial.println("MQTT MSG ARRIVED:");
    Serial.print(" --> topic=");
    Serial.println(topic);
    Serial.print(" --> payload=");
    Serial.println(message);
  }
}

bool mqtt_switch_check(const char *topic, const char *message,
                       const char *topic_switch,
                       const char *str_debug_set_switch,
                       bool switch_value_old, bool *switch_value)
{
  if (i_contains(topic, topic_switch) && i_contains(topic, MAC_char) && i_contains(topic, mqtt_subtopic_set))
  {
    bool new_switch_value;

    new_switch_value = i_contains(message, MQTT_STATE_ON);
    *switch_value = new_switch_value;
    if (new_switch_value != switch_value_old)
    {
      if (VERBOSE)
      {
        i_print_mqtt_msg(topic, message);
        Serial.print(str_debug_set_switch);
        Serial.println(new_switch_value ? MQTT_STATE_ON : MQTT_STATE_OFF);
      }
      client.publish((mqtt_control_topic + String(MAC_char) + topic_switch).c_str(),
                     new_switch_value ? MQTT_STATE_ON : MQTT_STATE_OFF, HIGH);
    }
    return true;
  }
  return false;
}

void callback_mqtt_message_received(char* topic, byte* payload, unsigned int payload_length)
{
  char *message;
  bool switch_value;
  byte *p = (byte*)malloc(payload_length);
  memcpy(p, payload, payload_length);
  message = (char*)p;

  //  Serial.print("- MQTT RECEIVED: ");
  //  Serial.println(topic);
  if (i_contains(topic, MQTT_WILLTOPIC) && i_contains(topic, MAC_char))
  {
    if (!i_contains(message, MQTT_STATE_ON))
    {
      i_print_mqtt_msg(topic, message);
      publish_online_state();
      Serial.println("published_online_state");
    }
  }
  else if (mqtt_switch_check(topic, message, mqtt_switch_bin_sensors_subtopic,
                             "SET use_binary_sensors = ", use_binary_sensors, &switch_value))
  {
    //Serial.println("USE BIN SENSORS CHANGED");
    use_binary_sensors = switch_value;
    in_default_state_binary_sensors = false;
  }
  else if (mqtt_switch_check(topic, message, mqtt_switch_leds_subtopic,
                             "SET use_leds = ", use_leds, &switch_value))
  {
    //Serial.println("USE LEDS CHANGED");
    use_leds = switch_value;
    in_default_state_use_leds = false;
  }
  else
  {
    Serial.println("WTF MQTT MESSAGE:");
    i_print_mqtt_msg(topic, message);
    //    read_json(p, payload_length);
  }
  free(p);
}
